cavityExample/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    tube_inlet
    {
        type            zeroGradient;
    }
    
    tube_outlet
    {
        type            zeroGradient;
    }

    tube_wall
    {
        type            zeroGradient;
    }
    shell_inlet
    {
        type            zeroGradient;
    }
    
    shell_outlet
    {
        type            zeroGradient;
    }

    shell_wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
