cavityExample/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.00754;

boundaryField
{
    tube_inlet
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    tube_outlet
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    tube_wall
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    shell_inlet
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    shell_outlet
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
    shell_wall
    {
        type            epsilonWallFunction;
        value           uniform 0.00754;
    }
}

// ************************************************************************* //
